Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.59/PIC32CM-JH01/edc/PIC32CM5164JH01032.PIC
      <edc:AdjustPoint edc:_addr="0x4000101D" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x40001020" edc:access="------------nnnn----nnnnnnnnnnnn" edc:cname="DPLLRATIO" edc:impl="0xF0FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="LDR" edc:desc="Loop Divider Ratio" edc:nzwidth="0xC"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="LDRFRAC" edc:desc="Loop Divider Ratio Fractional Part" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001024" edc:access="-----nnnnnnnnnnn---n-nnn--nnnnnn" edc:cname="DPLLCTRLB" edc:impl="0x7FF173F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="FILTER" edc:desc="Proportional Integral Filter Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="Default" edc:desc="Default Filter Mode" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LBFILT" edc:desc="Low Bandwidth Filter" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="HBFILT" edc:desc="High Bandwidth Filter" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="HDFILT" edc:desc="High Damping Filter" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LPEN" edc:desc="Low-Power Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WUF" edc:desc="Wake Up Fast" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REFCLK" edc:desc="Reference Clock Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="XOSC32K" edc:desc="XOSC32K Clock Reference" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="XOSC" edc:desc="XOSC Clock Reference" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="GCLK" edc:desc="GCLK Clock Reference" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LTIME" edc:desc="Lock Time" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="Default" edc:desc="No time-out. Automatic lock" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="8MS" edc:desc="Time-out if no lock within 8 ms" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="9MS" edc:desc="Time-out if no lock within 9 ms" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="10MS" edc:desc="Time-out if no lock within 10 ms" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="11MS" edc:desc="Time-out if no lock within 11 ms" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LBYPASS" edc:desc="Lock Bypass" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DIV" edc:desc="Clock Divider" edc:nzwidth="0xB"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001028" edc:access="------nn" edc:cname="DPLLPRESC" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="PRESC" edc:desc="Output Clock Prescaler" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="DPLL output is divided by 1" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="DPLL output is divided by 2" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="DPLL output is divided by 4" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40001029" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x4000102C" edc:access="----rrr-" edc:cname="DPLLSYNCBUSY" edc:impl="0xE" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="DPLL Enable Synchronization Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPLLRATIO" edc:desc="DPLL Ratio Synchronization Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPLLPRESC" edc:desc="DPLL Prescaler Synchronization Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4000102D" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x40001030" edc:access="------rr" edc:cname="DPLLSTATUS" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="LOCK" edc:desc="DPLL Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKRDY" edc:desc="DPLL Clock Ready" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40001031" edc:offset="0x7"/>
      <edc:SFRDef edc:_addr="0x40001038" edc:access="----------nnnnnn------nn--nnnnnn" edc:cname="CAL48M" edc:impl="0x3F033F" edc:mclr="00000000001000000000001000100000" edc:nzwidth="0x20" edc:por="00000000001000000000001000100000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="FCAL" edc:desc="Frequency Calibration (48MHz)" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FRANGE" edc:desc="Frequency Range (48MHz)" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="TCAL" edc:desc="Temperature Calibration (48MHz)" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4000103C" edc:offset="0x3C4"/>
      <edc:SFRDef edc:_addr="0x40001400" edc:access="-----------------------------nnn" edc:cname="INTENCLR" edc:impl="0x7" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSC32KCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:SFRFieldDef edc:cname="XOSC32KRDY" edc:desc="XOSC32K Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSC32KRDY" edc:desc="OSC32K Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKFAIL" edc:desc="XOSC32K Clock Failure Detector Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001404" edc:access="-----------------------------nnn" edc:cname="INTENSET" edc:impl="0x7" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSC32KCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:SFRFieldDef edc:cname="XOSC32KRDY" edc:desc="XOSC32K Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSC32KRDY" edc:desc="OSC32K Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKFAIL" edc:desc="XOSC32K Clock Failure Detector Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001408" edc:access="-----------------------------nnn" edc:cname="INTFLAG" edc:impl="0x7" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSC32KCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:SFRFieldDef edc:cname="XOSC32KRDY" edc:desc="XOSC32K Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSC32KRDY" edc:desc="OSC32K Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKFAIL" edc:desc="XOSC32K Clock Failure Detector" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
