Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.59/PIC32CM-JH01/edc/PIC32CM5164JH01032.PIC
      <edc:SFRDef edc:_addr="0x40001C30" edc:access="nnnnnnnnnnnnnnnn--nnnnnn---nnnnn" edc:cname="GENCTRL4" edc:impl="0xFFFF3F1F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="SRC" edc:desc="Source Select" edc:nzwidth="0x5">
              <edc:SFRFieldSemantic edc:cname="XOSC" edc:desc="XOSC oscillator output" edc:when="(field &amp; 0x1F) == 0"/>
              <edc:SFRFieldSemantic edc:cname="GCLKIN" edc:desc="Generator input pad (GCLK_IO)" edc:when="(field &amp; 0x1F) == 1"/>
              <edc:SFRFieldSemantic edc:cname="GCLKGEN1" edc:desc="Generic clock generator 1 output" edc:when="(field &amp; 0x1F) == 2"/>
              <edc:SFRFieldSemantic edc:cname="OSCULP32K" edc:desc="OSCULP32K oscillator output" edc:when="(field &amp; 0x1F) == 3"/>
              <edc:SFRFieldSemantic edc:cname="OSC32K" edc:desc="OSC32K oscillator output" edc:when="(field &amp; 0x1F) == 4"/>
              <edc:SFRFieldSemantic edc:cname="XOSC32K" edc:desc="XOSC32K oscillator output" edc:when="(field &amp; 0x1F) == 5"/>
              <edc:SFRFieldSemantic edc:cname="OSC48M" edc:desc="OSC48M oscillator output" edc:when="(field &amp; 0x1F) == 6"/>
              <edc:SFRFieldSemantic edc:cname="FDPLL96M" edc:desc="FDPLL96M output" edc:when="(field &amp; 0x1F) == 7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="GENEN" edc:desc="Generic Clock Generator Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IDC" edc:desc="Improve Duty Cycle" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OOV" edc:desc="Output Off Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OE" edc:desc="Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIVSEL" edc:desc="Divide Selection" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="Division by GENCTRLn.DIV" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Division by 2^(GENCTRLn.DIV+1)" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DIV" edc:desc="Division Factor" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001C34" edc:access="nnnnnnnnnnnnnnnn--nnnnnn---nnnnn" edc:cname="GENCTRL5" edc:impl="0xFFFF3F1F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="SRC" edc:desc="Source Select" edc:nzwidth="0x5">
              <edc:SFRFieldSemantic edc:cname="XOSC" edc:desc="XOSC oscillator output" edc:when="(field &amp; 0x1F) == 0"/>
              <edc:SFRFieldSemantic edc:cname="GCLKIN" edc:desc="Generator input pad (GCLK_IO)" edc:when="(field &amp; 0x1F) == 1"/>
              <edc:SFRFieldSemantic edc:cname="GCLKGEN1" edc:desc="Generic clock generator 1 output" edc:when="(field &amp; 0x1F) == 2"/>
              <edc:SFRFieldSemantic edc:cname="OSCULP32K" edc:desc="OSCULP32K oscillator output" edc:when="(field &amp; 0x1F) == 3"/>
              <edc:SFRFieldSemantic edc:cname="OSC32K" edc:desc="OSC32K oscillator output" edc:when="(field &amp; 0x1F) == 4"/>
              <edc:SFRFieldSemantic edc:cname="XOSC32K" edc:desc="XOSC32K oscillator output" edc:when="(field &amp; 0x1F) == 5"/>
              <edc:SFRFieldSemantic edc:cname="OSC48M" edc:desc="OSC48M oscillator output" edc:when="(field &amp; 0x1F) == 6"/>
              <edc:SFRFieldSemantic edc:cname="FDPLL96M" edc:desc="FDPLL96M output" edc:when="(field &amp; 0x1F) == 7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="GENEN" edc:desc="Generic Clock Generator Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IDC" edc:desc="Improve Duty Cycle" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OOV" edc:desc="Output Off Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OE" edc:desc="Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIVSEL" edc:desc="Divide Selection" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="Division by GENCTRLn.DIV" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Division by 2^(GENCTRLn.DIV+1)" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DIV" edc:desc="Division Factor" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001C38" edc:access="nnnnnnnnnnnnnnnn--nnnnnn---nnnnn" edc:cname="GENCTRL6" edc:impl="0xFFFF3F1F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="SRC" edc:desc="Source Select" edc:nzwidth="0x5">
              <edc:SFRFieldSemantic edc:cname="XOSC" edc:desc="XOSC oscillator output" edc:when="(field &amp; 0x1F) == 0"/>
              <edc:SFRFieldSemantic edc:cname="GCLKIN" edc:desc="Generator input pad (GCLK_IO)" edc:when="(field &amp; 0x1F) == 1"/>
              <edc:SFRFieldSemantic edc:cname="GCLKGEN1" edc:desc="Generic clock generator 1 output" edc:when="(field &amp; 0x1F) == 2"/>
              <edc:SFRFieldSemantic edc:cname="OSCULP32K" edc:desc="OSCULP32K oscillator output" edc:when="(field &amp; 0x1F) == 3"/>
              <edc:SFRFieldSemantic edc:cname="OSC32K" edc:desc="OSC32K oscillator output" edc:when="(field &amp; 0x1F) == 4"/>
              <edc:SFRFieldSemantic edc:cname="XOSC32K" edc:desc="XOSC32K oscillator output" edc:when="(field &amp; 0x1F) == 5"/>
              <edc:SFRFieldSemantic edc:cname="OSC48M" edc:desc="OSC48M oscillator output" edc:when="(field &amp; 0x1F) == 6"/>
              <edc:SFRFieldSemantic edc:cname="FDPLL96M" edc:desc="FDPLL96M output" edc:when="(field &amp; 0x1F) == 7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="GENEN" edc:desc="Generic Clock Generator Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IDC" edc:desc="Improve Duty Cycle" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OOV" edc:desc="Output Off Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OE" edc:desc="Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIVSEL" edc:desc="Divide Selection" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="Division by GENCTRLn.DIV" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Division by 2^(GENCTRLn.DIV+1)" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DIV" edc:desc="Division Factor" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
