Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.59/PIC32CM-JH01/edc/PIC32CM5164JH01032.PIC
      <edc:SFRDef edc:_addr="0x41008008" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnn-nn" edc:cname="FLOW" edc:impl="0xFFFFFFFB" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="MTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MTB">
            <edc:SFRFieldDef edc:cname="AUTOSTOP" edc:desc="Auto Stop Tracing" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AUTOHALT" edc:desc="Auto Halt Request" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WATERMARK" edc:desc="Watermark value" edc:nzwidth="0x1D"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100800C" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="BASE" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:AdjustPoint edc:_addr="0x41008010" edc:offset="0xEF0"/>
      <edc:SFRDef edc:_addr="0x41008F00" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ITCTRL" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:AdjustPoint edc:_addr="0x41008F04" edc:offset="0x9C"/>
      <edc:SFRDef edc:_addr="0x41008FA0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CLAIMSET" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41008FA4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CLAIMCLR" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:AdjustPoint edc:_addr="0x41008FA8" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x41008FB0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="LOCKACCESS" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41008FB4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="LOCKSTATUS" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41008FB8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="AUTHSTATUS" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41008FBC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DEVARCH" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:AdjustPoint edc:_addr="0x41008FC0" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x41008FC8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DEVID" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41008FCC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DEVTYPE" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41008FD0" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID4" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41008FD4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID5" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41008FD8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID6" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41008FDC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID7" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41008FE0" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID0" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41008FE4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID1" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41008FE8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID2" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41008FEC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID3" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41008FF0" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CID0" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41008FF4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CID1" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41008FF8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CID2" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x41008FFC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CID3" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x42000000" edc:endaddr="0x42006C08" edc:regionid="HPB2" edc:rw="rw">
      <edc:SFRDef edc:_addr="0x42000000" edc:access="-------n" edc:cname="CTRLA" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42000001" edc:offset="0xB"/>
      <edc:SFRDef edc:_addr="0x4200000C" edc:access="----rrrrrrrrrrrr----rrrrrrrrrrrr" edc:cname="CHSTATUS" edc:impl="0xFFF0FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="USRRDY0" edc:desc="Channel 0 User Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USRRDY1" edc:desc="Channel 1 User Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USRRDY2" edc:desc="Channel 2 User Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USRRDY3" edc:desc="Channel 3 User Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USRRDY4" edc:desc="Channel 4 User Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USRRDY5" edc:desc="Channel 5 User Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USRRDY6" edc:desc="Channel 6 User Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USRRDY7" edc:desc="Channel 7 User Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USRRDY8" edc:desc="Channel 8 User Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USRRDY9" edc:desc="Channel 9 User Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USRRDY10" edc:desc="Channel 10 User Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USRRDY11" edc:desc="Channel 11 User Ready" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CHBUSY0" edc:desc="Channel 0 Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHBUSY1" edc:desc="Channel 1 Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHBUSY2" edc:desc="Channel 2 Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHBUSY3" edc:desc="Channel 3 Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHBUSY4" edc:desc="Channel 4 Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHBUSY5" edc:desc="Channel 5 Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHBUSY6" edc:desc="Channel 6 Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHBUSY7" edc:desc="Channel 7 Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHBUSY8" edc:desc="Channel 8 Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHBUSY9" edc:desc="Channel 9 Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHBUSY10" edc:desc="Channel 10 Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHBUSY11" edc:desc="Channel 11 Busy" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
