Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.59/PIC32CM-JH01/edc/PIC32CM5164JH01032.PIC
      <edc:AdjustPoint edc:_addr="0x42005818" edc:offset="0xBE8"/>
      <edc:SFRDef edc:_addr="0x42006400" edc:access="----------------nnnn--nnnnnn-nnn" edc:cname="CFG" edc:impl="0xF3F7" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ICM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="WBDIS" edc:desc="Write Back Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOMDIS" edc:desc="End of Monitoring Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SLBDIS" edc:desc="Secondary List Branching Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BBC" edc:desc="Bus Burden Control" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="ASCD" edc:desc="Automatic Switch To Compare Digest" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUALBUFF" edc:desc="Dual Input Buffer" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="UIHASH" edc:desc="User Initial Hash Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UALGO" edc:desc="User SHA Algorithm" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="SHA1" edc:desc="SHA1 Algorithm" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SHA256" edc:desc="SHA256 Algorithm" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SHA224" edc:desc="SHA224 Algorithm" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42006404" edc:access="----------------wwwwwwwwwwww-www" edc:cname="CTRL" edc:impl="0xFFF7" edc:nzwidth="0x20" ltx:memberofperipheral="ICM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="ICM Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DISABLE" edc:desc="ICM Disable Register" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="REHASH" edc:desc="Recompute Internal Hash" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RMDIS" edc:desc="Region Monitoring Disable" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RMEN" edc:desc="Region Monitoring Enable" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42006408" edc:access="----------------rrrrrrrr-------r" edc:cname="SR" edc:impl="0xFF01" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ICM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="ICM Controller Enable Register" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="RAWRMDIS" edc:desc="RAW Region Monitoring Disabled Status" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RMDIS" edc:desc="Region Monitoring Disabled Status" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4200640C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x42006410" edc:access="-------wwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="IER" edc:impl="0x1FFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ICM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="RHC" edc:desc="Region Hash Completed Interrupt Enable" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RDM" edc:desc="Region Digest Mismatch Interrupt Enable" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RBE" edc:desc="Region Bus Error Interrupt Enable" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RWC" edc:desc="Region Wrap Condition detected Interrupt Enable" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="REC" edc:desc="Region End bit Condition Detected Interrupt Enable" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RSU" edc:desc="Region Status Updated Interrupt Disable" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="URAD" edc:desc="Undefined Register Access Detection Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42006414" edc:access="-------wwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="IDR" edc:impl="0x1FFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ICM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="RHC" edc:desc="Region Hash Completed Interrupt Disable" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RDM" edc:desc="Region Digest Mismatch Interrupt Disable" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RBE" edc:desc="Region Bus Error Interrupt Disable" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RWC" edc:desc="Region Wrap Condition Detected Interrupt Disable" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="REC" edc:desc="Region End bit Condition detected Interrupt Disable" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RSU" edc:desc="Region Status Updated Interrupt Disable" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="URAD" edc:desc="Undefined Register Access Detection Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42006418" edc:access="-------rrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="IMR" edc:impl="0x1FFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ICM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="RHC" edc:desc="Region Hash Completed Interrupt Mask" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RDM" edc:desc="Region Digest Mismatch Interrupt Mask" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RBE" edc:desc="Region Bus Error Interrupt Mask" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RWC" edc:desc="Region Wrap Condition Detected Interrupt Mask" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="REC" edc:desc="Region End bit Condition Detected Interrupt Mask" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RSU" edc:desc="Region Status Updated Interrupt Mask" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="URAD" edc:desc="Undefined Register Access Detection Interrupt Mask" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200641C" edc:access="-------rrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="ISR" edc:impl="0x1FFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ICM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="RHC" edc:desc="Region Hash Completed" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RDM" edc:desc="Region Digest Mismatch" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RBE" edc:desc="Region Bus Error" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RWC" edc:desc="Region Wrap Condition Detected" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="REC" edc:desc="Region End bit Condition Detected" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="RSU" edc:desc="Region Status Updated Detected" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="URAD" edc:desc="Undefined Register Access Detection Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42006420" edc:access="-----------------------------rrr" edc:cname="UASR" edc:impl="0x7" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ICM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="URAT" edc:desc="Undefined Register Access Trace" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="UNSPEC_STRUCT_MEMBER" edc:desc="Unspecified structure member set to one detected when the descriptor is loaded" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CFG_MODIFIED" edc:desc="CFG modified during active monitoring" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DSCR_MODIFIED" edc:desc="DSCR modified during active monitoring" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="HASH_MODIFIED" edc:desc="HASH modified during active monitoring" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="READ_ACCESS" edc:desc="Write-only register read access" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42006424" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x42006430" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnn------" edc:cname="DSCR" edc:impl="0xFFFFFFC0" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ICM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="DASA" edc:desc="Descriptor Area Start Address" edc:nzwidth="0x1A"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42006434" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnn-------" edc:cname="HASH" edc:impl="0xFFFFFF80" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ICM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="HASA" edc:desc="Hash Area Start Address" edc:nzwidth="0x19"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
